; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p8---int100n150-m25---int100c110---s142---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level9 level9)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level9 level10)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level9 level11)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level9 level12)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level9 level13)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level9 level14)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level9 level15)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level9 level16)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level9 level17)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level9 level18)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level9 level19)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level9 level20)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level9 level21)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level9 level22)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level9 level23)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level9 level24)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level9 level25)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level9 level26)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level9 level27)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level9 level28)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level9 level29)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level9 level30)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level9 level31)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level9 level32)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level9 level33)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level9 level34)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level9 level35)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level9 level36)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level9 level37)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level9 level38)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level9 level39)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level9 level40)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level9 level41)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level9 level42)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level9 level43)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level9 level44)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level9 level45)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level9 level46)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level9 level47)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level9 level48)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level21 level60)
(sum level39 level22 level61)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level9 level49)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level21 level61)
(sum level40 level22 level62)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level9 level50)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level21 level62)
(sum level41 level22 level63)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level9 level51)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level21 level63)
(sum level42 level22 level64)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level9 level52)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level21 level64)
(sum level43 level22 level65)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level9 level53)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level21 level65)
(sum level44 level22 level66)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level9 level54)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level21 level66)
(sum level45 level22 level67)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level9 level55)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level21 level67)
(sum level46 level22 level68)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level9 level56)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level47 level21 level68)
(sum level47 level22 level69)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level9 level57)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level48 level21 level69)
(sum level48 level22 level70)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level9 level58)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level49 level21 level70)
(sum level49 level22 level71)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level9 level59)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level50 level21 level71)
(sum level50 level22 level72)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level9 level60)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level18 level69)
(sum level51 level21 level72)
(sum level51 level22 level73)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level9 level61)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level18 level70)
(sum level52 level21 level73)
(sum level52 level22 level74)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level9 level62)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level18 level71)
(sum level53 level21 level74)
(sum level53 level22 level75)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level9 level63)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level18 level72)
(sum level54 level21 level75)
(sum level54 level22 level76)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level9 level64)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level18 level73)
(sum level55 level21 level76)
(sum level55 level22 level77)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level9 level65)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level18 level74)
(sum level56 level21 level77)
(sum level56 level22 level78)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level9 level66)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level18 level75)
(sum level57 level21 level78)
(sum level57 level22 level79)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level9 level67)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level18 level76)
(sum level58 level21 level79)
(sum level58 level22 level80)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level9 level68)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level18 level77)
(sum level59 level21 level80)
(sum level59 level22 level81)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level9 level69)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level18 level78)
(sum level60 level21 level81)
(sum level60 level22 level82)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level9 level70)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level18 level79)
(sum level61 level21 level82)
(sum level61 level22 level83)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level9 level71)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level18 level80)
(sum level62 level21 level83)
(sum level62 level22 level84)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level9 level72)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level18 level81)
(sum level63 level21 level84)
(sum level63 level22 level85)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level9 level73)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level18 level82)
(sum level64 level21 level85)
(sum level64 level22 level86)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level9 level74)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level65 level18 level83)
(sum level65 level21 level86)
(sum level65 level22 level87)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level9 level75)
(sum level66 level14 level80)
(sum level66 level15 level81)
(sum level66 level18 level84)
(sum level66 level21 level87)
(sum level66 level22 level88)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level9 level76)
(sum level67 level14 level81)
(sum level67 level15 level82)
(sum level67 level18 level85)
(sum level67 level21 level88)
(sum level67 level22 level89)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level9 level77)
(sum level68 level14 level82)
(sum level68 level15 level83)
(sum level68 level18 level86)
(sum level68 level21 level89)
(sum level68 level22 level90)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level9 level78)
(sum level69 level14 level83)
(sum level69 level15 level84)
(sum level69 level18 level87)
(sum level69 level21 level90)
(sum level69 level22 level91)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level9 level79)
(sum level70 level14 level84)
(sum level70 level15 level85)
(sum level70 level18 level88)
(sum level70 level21 level91)
(sum level70 level22 level92)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level9 level80)
(sum level71 level14 level85)
(sum level71 level15 level86)
(sum level71 level18 level89)
(sum level71 level21 level92)
(sum level71 level22 level93)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level9 level81)
(sum level72 level14 level86)
(sum level72 level15 level87)
(sum level72 level18 level90)
(sum level72 level21 level93)
(sum level72 level22 level94)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level9 level82)
(sum level73 level14 level87)
(sum level73 level15 level88)
(sum level73 level18 level91)
(sum level73 level21 level94)
(sum level73 level22 level95)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level9 level83)
(sum level74 level14 level88)
(sum level74 level15 level89)
(sum level74 level18 level92)
(sum level74 level21 level95)
(sum level74 level22 level96)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level9 level84)
(sum level75 level14 level89)
(sum level75 level15 level90)
(sum level75 level18 level93)
(sum level75 level21 level96)
(sum level75 level22 level97)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level9 level85)
(sum level76 level14 level90)
(sum level76 level15 level91)
(sum level76 level18 level94)
(sum level76 level21 level97)
(sum level76 level22 level98)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level9 level86)
(sum level77 level14 level91)
(sum level77 level15 level92)
(sum level77 level18 level95)
(sum level77 level21 level98)
(sum level77 level22 level99)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level9 level87)
(sum level78 level14 level92)
(sum level78 level15 level93)
(sum level78 level18 level96)
(sum level78 level21 level99)
(sum level78 level22 level100)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level9 level88)
(sum level79 level14 level93)
(sum level79 level15 level94)
(sum level79 level18 level97)
(sum level79 level21 level100)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level9 level89)
(sum level80 level14 level94)
(sum level80 level15 level95)
(sum level80 level18 level98)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level81 level9 level90)
(sum level81 level14 level95)
(sum level81 level15 level96)
(sum level81 level18 level99)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level82 level9 level91)
(sum level82 level14 level96)
(sum level82 level15 level97)
(sum level82 level18 level100)
(sum level83 level1 level84)
(sum level83 level2 level85)
(sum level83 level9 level92)
(sum level83 level14 level97)
(sum level83 level15 level98)
(sum level84 level1 level85)
(sum level84 level2 level86)
(sum level84 level9 level93)
(sum level84 level14 level98)
(sum level84 level15 level99)
(sum level85 level1 level86)
(sum level85 level2 level87)
(sum level85 level9 level94)
(sum level85 level14 level99)
(sum level85 level15 level100)
(sum level86 level1 level87)
(sum level86 level2 level88)
(sum level86 level9 level95)
(sum level86 level14 level100)
(sum level87 level1 level88)
(sum level87 level2 level89)
(sum level87 level9 level96)
(sum level88 level1 level89)
(sum level88 level2 level90)
(sum level88 level9 level97)
(sum level89 level1 level90)
(sum level89 level2 level91)
(sum level89 level9 level98)
(sum level90 level1 level91)
(sum level90 level2 level92)
(sum level90 level9 level99)
(sum level91 level1 level92)
(sum level91 level2 level93)
(sum level91 level9 level100)
(sum level92 level1 level93)
(sum level92 level2 level94)
(sum level93 level1 level94)
(sum level93 level2 level95)
(sum level94 level1 level95)
(sum level94 level2 level96)
(sum level95 level1 level96)
(sum level95 level2 level97)
(sum level96 level1 level97)
(sum level96 level2 level98)
(sum level97 level1 level98)
(sum level97 level2 level99)
(sum level98 level1 level99)
(sum level98 level2 level100)
(sum level99 level1 level100)

(connected l0 l4)
(fuelcost level21 l0 l4)
(connected l0 l5)
(fuelcost level22 l0 l5)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l1 l4)
(fuelcost level9 l1 l4)
(connected l1 l5)
(fuelcost level1 l1 l5)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l5)
(fuelcost level14 l2 l5)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l5)
(fuelcost level15 l3 l5)
(connected l4 l0)
(fuelcost level21 l4 l0)
(connected l4 l1)
(fuelcost level9 l4 l1)
(connected l4 l5)
(fuelcost level2 l4 l5)
(connected l5 l0)
(fuelcost level22 l5 l0)
(connected l5 l1)
(fuelcost level1 l5 l1)
(connected l5 l2)
(fuelcost level14 l5 l2)
(connected l5 l3)
(fuelcost level15 l5 l3)
(connected l5 l4)
(fuelcost level2 l5 l4)

(at t0 l3)
(fuel t0 level100)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l3)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l5)
(at p7 l1)
)

(:goal
(and
(at p0 l5)
(at p1 l1)
(at p2 l4)
(at p3 l1)
(at p4 l0)
(at p5 l5)
(at p6 l2)
(at p7 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 8
2. (drive t0 l3 l1 level82 level18 level100)
   deleted: (at t0 l3) (fuel t0 level100)
   added: (at t0 l1) (fuel t0 level82)
   goals met: 0 of 8
3. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 8
4. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 8
5. (drive t0 l1 l4 level73 level9 level82)
   deleted: (at t0 l1) (fuel t0 level82)
   added: (at t0 l4) (fuel t0 level73)
   goals met: 0 of 8
6. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 1 of 8
7. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 2 of 8
8. (drive t0 l4 l0 level52 level21 level73)
   deleted: (at t0 l4) (fuel t0 level73)
   added: (at t0 l0) (fuel t0 level52)
   goals met: 2 of 8
9. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 3 of 8
10. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 3 of 8
11. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 8
12. (drive t0 l0 l5 level30 level22 level52)
   deleted: (at t0 l0) (fuel t0 level52)
   added: (at t0 l5) (fuel t0 level30)
   goals met: 3 of 8
13. (load p6 t0 l5)
   deleted: (at p6 l5)
   added: (in p6 t0)
   goals met: 3 of 8
14. (drive t0 l5 l2 level16 level14 level30)
   deleted: (at t0 l5) (fuel t0 level30)
   added: (at t0 l2) (fuel t0 level16)
   goals met: 3 of 8
15. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 3 of 8
16. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 3 of 8
17. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 4 of 8
18. (drive t0 l2 l5 level2 level14 level16)
   deleted: (at t0 l2) (fuel t0 level16)
   added: (at t0 l5) (fuel t0 level2)
   goals met: 4 of 8
19. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 5 of 8
20. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 6 of 8
21. (drive t0 l5 l1 level1 level1 level2)
   deleted: (at t0 l5) (fuel t0 level2)
   added: (at t0 l1) (fuel t0 level1)
   goals met: 6 of 8
22. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 7 of 8
23. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 8 of 8
